{
    "Desarrollador de Frontend": "Frontend Developer",
    "Formo parte de un proyecto en el que se desarrolla una plataforma cloud cuyo software optimiza el funcionamiento de instalaciones de frío industrial y frío comercial en base a soluciones desarrolladas mediante inteligencia artificial.": "I am part of a project that develops a cloud platform whose software optimizes the operation of industrial refrigeration and commercial refrigeration installations based on solutions developed through artificial intelligence.",
    "Agente TIC": "ICT Agent",
    "Mi trabajo estaba centrado en la organización y ejecución de planes de formación en un centro para la modernización e inclusión tecnológica. Me encargaba de diseñar e impartir cursos de diversas temáticas.": "My work focused on organizing and executing training plans in a center for technological modernization and inclusion. I was responsible for designing and delivering courses on various topics.",
    "Técnico de formación": "Training Technician",
    "Responsable de formación sobre el uso de bases de datos de documentación jurídica.": "Responsible for training on the use of legal documentation databases.",
    "Portfolio": "Portfolio",
    "Proyecto personal": "Personal Project",
    "En este proyecto he tratado de crear un portfolio sencillo que me sirva como muestra de cara a la búsqueda de empleo. La parte de backend ha sido desarrollada con Node.js, consta de un pequeño servidor conectado a una base de datos MySql. En la parte de front se ha utilizado React y TypeScript con Css Modules. He utilizado Netlify para el despliegue del front y Railway para el despliegue del back.": "In this project, I tried to create a simple portfolio to serve as a showcase for my job search. The backend has been developed with Node.js and consists of a small server connected to a MySQL database. On the frontend, React and TypeScript with CSS Modules have been used. I used Netlify for the frontend deployment and Railway for the backend deployment.",
    "Gestión industrial": "Industrial Management",
    "Proyecto profesional, no puedo dar muchos detalles ni mostrar código por compromiso de confidencialidad. La finalidad de la aplicación es optimizar los procesos internos de instalaciones de frío industrial y comercial. En front usamos React con CSS, librerías de distintos tipos, servicios de geolocalización, consumo de servicios de IA en Python, y servicios de back en Java.": "Professional project, I can't provide many details or show code due to confidentiality commitments. The purpose of the application is to optimize internal processes for industrial and commercial refrigeration installations. On the frontend, we used React with CSS, various libraries, geolocation services, AI services in Python, and backend services in Java.",
    "Administración": "Administration",
    "Proyecto profesional, no puedo dar muchos detalles ni mostrar código por compromiso de confidencialidad. En este caso el proyecto consiste en una app de uso interno para poder dar de alta y administrar las instalaciones anteriormente mencionadas. En front usamos React con CSS, librerías de distintos tipos, consumo de servicios de IA en Python, y servicios de back en Java.": "Professional project, I can't provide many details or show code due to confidentiality commitments. In this case, the project consists of an internal app to register and manage the aforementioned installations. On the frontend, we used React with CSS, various libraries, AI services in Python, and backend services in Java.",
    "Callcenter": "Call Center",
    "Proyecto profesional, no puedo dar muchos detalles ni mostrar código por compromiso de confidencialidad. En este caso el proyecto consiste en una app gestionar incidencias en un Callcenter. En front usamos React con CSS, Tailwind, comunicación con WebSockets, consumo de servicios de IA en Python, y servicios de back en Java.": "Professional project, I can't provide many details or show code due to confidentiality commitments. In this case, the project consists of an app to manage incidents in a call center. On the frontend, we used React with CSS, Tailwind, WebSocket communication, AI services in Python, and backend services in Java.",
    "Red Social": "Social Network",
    "Proyecto final de Bootcamp, se trata de una red social donde los usuarios pueden interactuar de diversas formas. La idea era crear un app donde se pudieran poner en contacto tatuadores y estudios. Los usuarios tienen roles, pueden publicar fotos o vídeos para mostrar su trabajo, añadiendo ubicación, categorías... Para el backend se usó Node y Express conectado a una base de datos MySql, en la parte de frontend se usó React con CSS.": "Final Bootcamp project, this is a social network where users can interact in various ways. The idea was to create an app for tattoo artists and studios to get in touch. Users have roles and can post photos or videos to showcase their work, adding location, categories, etc. For the backend, Node and Express connected to a MySQL database were used, and for the frontend, React with CSS.",
    "Facturador": "Invoicing System",
    "Proyecto formativo. Aplicación que permite interactuar con facturas (creación, edición, listados... etc). Contiene servicio de autentificación y uso de metadata. La intención fue mejorar el uso de Next. Se usó tipado con TypeScript, estilos con Tailwind y base de datos MySql. Despliegue en Vercel.": "Training project. An application that allows interaction with invoices (creation, editing, listings, etc.). It includes an authentication service and metadata usage. The goal was to improve the use of Next.js. Typed with TypeScript, styled with Tailwind, and using a MySQL database. Deployed on Vercel."
}
